{"posts":[{"id":1,"views":7,"author":"conditackler","title":"I can’t believe someone broke into our garage and stole our limbo stick. Seriously, how low can you go?","body":"see title :(","comments":[{"author":"triplewhammy2","body":"I saw someone pole vaulting in the park with a stripey yellow stick, which I remember thinking looked very similar to the limbo stick at your party last year... if this is the case then I think Harriet is your culprit."},{"author":"Extremiel","body":"Harriet is a copycat, she probably just recreated it when she saw it at the party last year.\nShe painted her car red a few weeks ago when she saw my new red subaru.\n\n(DO NOT COPY THIS COMMENT AS WELL HARRIET I AM WATCHING YOU.)"},{"author":"Gabenfoodle","body":"Harriet is a copycat, she probably just recreated it when she saw it at the party last year.\nShe painted her car red a few weeks ago when she saw my new red subaru.\n\n(DO NOT COPY THIS COMMENT AS WELL HARRIET I AM WATCHING YOU.)"}]},{"id":2,"views":4,"author":"nick5734324","title":"whoever keeps blowdrying our cows, could you PLEASE stop.","body":"This has Richland high seniors written ALL over it.","comments":[{"author":"Lukiniobro","body":"Hahaha I think that was cousin Lou and his skater mates! LEGENDS!!"},{"author":"iChasedragons","body":"If they're wet, I WILL DRY THEM. Mind your business."},{"author":"Willy16glo","body":"Lou stole my son’s state quarters collection 7 months ago. I’ve demanded he apologize and give it back, but he won’t do it and that mother of his won’t make him. I’m telling you this not to be a gossip, just keep him in your prayers, because he isn’t living with the lord, bless his heart."}]},{"id":3,"views":3,"author":"WhatsaGime","title":"CAN WHOEVER HAS HAD THE 'FACEBOOK FOR DUMMIES' BOOK OUT FROM THE LIBRARY FOR 6 WEEKS STRAIGHT PLEASE RETURN IT!!!! MY NEPHEW HAS BEEN WAITING 6 WEEKS FOR ME TO LIKE HIS PROFILE IMAGE!!!!!","body":"I NEED THAT BOOK!!! VERY SELFISH TO KEEP IT FOR THIS LONG!!!!","comments":[{"author":"phiv555","body":"See, what you could've done in the meantime is print out your nephew's profile picture, write the word \"LIKE\" on it, and then fax that to him, but I guess you lazy, entitled millenials are all the same."},{"author":"WhatsaGime","body":"I DO NOT HAVE A PRINTER AND THE LIBRARY’S PRINTER COST $1 TO USE!!! DISGRACEFUL TO CHARGE SENIOR CITIZENS!!!"}]},{"id":4,"views":0,"author":"Admin","title":"Post Credits","body":"All sample blog posts courtesy of https://www.reddit.com/r/HaveWeMet/","comments":[]}]}